---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementLevelFilter Constructor
ElementLevelFilter Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ElementLevelFilter(ElementId) | Constructs a new instance of an ElementLevelFilter. |
|  | ElementLevelFilter(ElementId, Boolean) | Constructs a new instance of an ElementLevelFilter, with the option to match all elements not associated to the given level id. |

# See Also

ElementLevelFilter Class

ElementLevelFilter Members

Autodesk.Revit.DB Namespace